const khmerMonthsShort = <String>[
  'មករា',
  'កុម្ភៈ',
  'មីនា',
  'មេសា',
  'ឧសភា',
  'មិថុនា',
  'កក្កដា',
  'សីហា',
  'កញ្ញា',
  'តុលា',
  'វិច្ឆិកា',
  'ធ្នូ',
];

const khmerMonthsLong = <String>[
  'ខែមករា',
  'ខែកុម្ភៈ',
  'ខែមីនា',
  'ខែមេសា',
  'ខែឧសភា',
  'ខែមិថុនា',
  'ខែកក្កដា',
  'ខែសីហា',
  'ខែកញ្ញា',
  'ខែតុលា',
  'ខែវិច្ឆិកា',
  'ខែធ្នូ',
];

const khmerWeekdaysShort = <String>[
  'ចន្ទ',
  'អង្គារ',
  'ពុធ',
  'ព្រហស្បតិ៍',
  'សុក្រ',
  'សៅរ៍',
  'អាទិត្យ',
];

const khmerWeekdaysLong = <String>[
  'ថ្ងៃចន្ទ',
  'ថ្ងៃអង្គារ',
  'ថ្ងៃពុធ',
  'ថ្ងៃព្រហស្បតិ៍',
  'ថ្ងៃសុក្រ',
  'ថ្ងៃសៅរ៍',
  'ថ្ងៃអាទិត្យ',
];

const khmerAm = 'ព្រឹក';
const khmerPm = 'ល្ងាច';
